In [6]:
import pandas as pd
import os

<ul>
<li>Potentially columns are of different types</li>
<li>Size â€“ Mutable</li>
<li>Labeled axes (rows and columns)</li>
<li>Can Perform Arithmetic operations on rows and columns</li>
</ul>

# Create DataFrames

```python
pd.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)
```

In [2]:
#from list
data = [1,2,3,4,5]
pd.DataFrame(data)

   0
0  1
1  2
2  3
3  4
4  5

In [3]:
#from array
data = [['Alex',10],['Bob',12],['Clarke',13]]
pd.DataFrame(data, columns = ['name', 'score'], dtype = float)

     name  score
0    Alex   10.0
1     Bob   12.0
2  Clarke   13.0

In [4]:
#from dict
data = {'Name':['Tom', 'Jack', 'Steve', 'Ricky'],'Age':[28,34,29,42]}
pd.DataFrame(data, dtype = float, index = pd.Index(['M', 'F', 'F', 'M'], name = 'Gender'))

         Name   Age
Gender
M         Tom  28.0
F        Jack  34.0
F       Steve  29.0
M       Ricky  42.0

In [5]:
#from list of dict
data = [{'a': 1, 'b': 2},{'a': 5, 'b': 10, 'c': 20}]
pd.DataFrame(data)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [6]:
#from dict of Series
d = {'one' : pd.Series([1, 2, 3], index=['a', 'b', 'c']),
   'two' : pd.Series([1, 2, 3, 4], index=['a', 'b', 'c', 'd'])}
pd.DataFrame(d)

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

# Properties

<h3><b style = 'color:red'>Like 2D ndarray</b></h3>

In [7]:
data = [
    ['VN Champions', 30],
    ['Dirilis', 35],
    ['Iron Core', 30]
]

TF = pd.DataFrame(data, index = ['VN Pikachu', 'ARMAGEDON', 'JOSEPH'], columns = ['clan', 'level'])
TF

                    clan  level
VN Pikachu  VN Champions     30
ARMAGEDON        Dirilis     35
JOSEPH         Iron Core     30

## Shape

In [8]:
TF.shape

(3, 2)

## ndim

In [9]:
TF.ndim

2

## size

In [10]:
TF.size

6

## index

In [11]:
TF.index

Index(['VN Pikachu', 'ARMAGEDON', 'JOSEPH'], dtype='object')

## columns

In [12]:
TF.columns

Index(['clan', 'level'], dtype='object')

## values

In [13]:
TF.values

array([['VN Champions', 30],
       ['Dirilis', 35],
       ['Iron Core', 30]], dtype=object)

## transpose

In [14]:
TF.T

         VN Pikachu ARMAGEDON     JOSEPH
clan   VN Champions   Dirilis  Iron Core
level            30        35         30

## empty

In [15]:
TF.empty

False

## dtypes

In [16]:
TF.dtypes

clan     object
level     int64
dtype: object

## DataFrame.keys()

In [17]:
TF.keys()

Index(['clan', 'level'], dtype='object')

## DataFrame.items()

In [18]:
TF.items()

In [19]:
for index, column in TF.items():
    print(index)
    print(column)
    print('_' * 50)

clan
VN Pikachu    VN Champions
ARMAGEDON          Dirilis
JOSEPH           Iron Core
Name: clan, dtype: object
__________________________________________________
level
VN Pikachu    30
ARMAGEDON     35
JOSEPH        30
Name: level, dtype: int64
__________________________________________________

# Iterating

## column name

In [20]:
for column_name in TF:
    print(column_name)

clan
level

## (column name, column value)

In [21]:
for column_name, column_value in TF.items():
    print(column_name)
    print(column_value)
    print('_' * 50)

clan
VN Pikachu    VN Champions
ARMAGEDON          Dirilis
JOSEPH           Iron Core
Name: clan, dtype: object
__________________________________________________
level
VN Pikachu    30
ARMAGEDON     35
JOSEPH        30
Name: level, dtype: int64
__________________________________________________

## row name

In [22]:
for row_name in TF.T:
    print(row_name)

VN Pikachu
ARMAGEDON
JOSEPH

## row name, row value

In [23]:
for row_name, row_value in TF.T.items():
    print(row_name)
    print(row_value)
    print('_' * 50)

VN Pikachu
clan     VN Champions
level              30
Name: VN Pikachu, dtype: object
__________________________________________________
ARMAGEDON
clan     Dirilis
level         35
Name: ARMAGEDON, dtype: object
__________________________________________________
JOSEPH
clan     Iron Core
level           30
Name: JOSEPH, dtype: object
__________________________________________________

# Access and Modify

## Column

### selection

In [24]:
#selection 1 column
TF['clan']

VN Pikachu    VN Champions
ARMAGEDON          Dirilis
JOSEPH           Iron Core
Name: clan, dtype: object

In [25]:
#select multiple columns]
TF[['level', 'clan']]

            level          clan
VN Pikachu     30  VN Champions
ARMAGEDON      35       Dirilis
JOSEPH         30     Iron Core

<hr>

<b style = 'color:red'>Advanced: <code>DataFrame.iloc</code>, <code>DataFrame.loc</code></b>

In [26]:
TF.loc[:, 'clan']

VN Pikachu    VN Champions
ARMAGEDON          Dirilis
JOSEPH           Iron Core
Name: clan, dtype: object

In [27]:
TF.loc[:,  ['level', 'clan']]

            level          clan
VN Pikachu     30  VN Champions
ARMAGEDON      35       Dirilis
JOSEPH         30     Iron Core

In [28]:
TF.iloc[:, 0]

VN Pikachu    VN Champions
ARMAGEDON          Dirilis
JOSEPH           Iron Core
Name: clan, dtype: object

In [29]:
TF.iloc[:, [1,0]]

            level          clan
VN Pikachu     30  VN Champions
ARMAGEDON      35       Dirilis
JOSEPH         30     Iron Core

### addition

In [30]:
#constant (broadcasting)
TF['level'] += 1
TF

                    clan  level
VN Pikachu  VN Champions     31
ARMAGEDON        Dirilis     36
JOSEPH         Iron Core     31

In [31]:
#array
TF['level'] -= [1,1,1]
TF['level']

VN Pikachu    30
ARMAGEDON     35
JOSEPH        30
Name: level, dtype: int64

In [32]:
#Series
s = pd.Series(1, index = TF.index)
TF['level'] -= s
TF

                    clan  level
VN Pikachu  VN Champions     29
ARMAGEDON        Dirilis     34
JOSEPH         Iron Core     29

### Add a new column

In [33]:
countries = ['Viet Nam', 'Ukraina', 'Korea']
TF['country'] = countries #we can also create a Series
#equivalent: TF['country'] = pd.Series(countries, index = TF.index)
TF

                    clan  level   country
VN Pikachu  VN Champions     29  Viet Nam
ARMAGEDON        Dirilis     34   Ukraina
JOSEPH         Iron Core     29     Korea

### Deletion

```python
DataFrame.drop(
    labels=None,
    axis=0,
    index=None,
    columns=None,
    level=None,
    inplace=False,
    errors='raise',
)
```

let's remove the clan and country columns

In [34]:
TF.drop(columns = ['clan', 'country']) #return the modified DataFrame

            level
VN Pikachu     29
ARMAGEDON      34
JOSEPH         29

<b style = 'color:red'> If you wanna modify the original DataFrame, set <code>inplace = True</code></b>

<hr>

```python
TF.drop(columns = ['clan', 'country'], inplace = True)
```

```python
DataFrame.pop(item)```

Return item and drop from frame. Raise KeyError if not found. <b style = 'color:red'>This will modify the original array</b>

In [35]:
TF.pop('level')

VN Pikachu    29
ARMAGEDON     34
JOSEPH        29
Name: level, dtype: int64

In [36]:
TF

                    clan   country
VN Pikachu  VN Champions  Viet Nam
ARMAGEDON        Dirilis   Ukraina
JOSEPH         Iron Core     Korea

<hr>

In [37]:
pd.concat?

## Row

### selection

<b><code>DataFrame.loc</code>, <code>DataFrame.iloc</code></b>

 let's select the second row

In [38]:
TF.iloc[1]

clan       Dirilis
country    Ukraina
Name: ARMAGEDON, dtype: object

In [39]:
TF.loc['ARMAGEDON']

clan       Dirilis
country    Ukraina
Name: ARMAGEDON, dtype: object

let's select last 2 rows:

In [40]:
TF.iloc[-2:]

                clan  country
ARMAGEDON    Dirilis  Ukraina
JOSEPH     Iron Core    Korea

In [41]:
TF.loc[TF.index[-2:]]

                clan  country
ARMAGEDON    Dirilis  Ukraina
JOSEPH     Iron Core    Korea

## Addition

<b style = 'color:red'>like Column</b>

## Adding new rows

Append rows of `other` to the end of caller, returning a new object.

Columns in `other` that are not in the caller are added as new columns.

<b><code>DataFrame.append</code></b>

```python
TF.append(other, ignore_index=False, verify_integrity=False, sort=None)
```

other : DataFrame or Series/dict-like object, or list of these
    The data to append.

In [42]:
TF

                    clan   country
VN Pikachu  VN Champions  Viet Nam
ARMAGEDON        Dirilis   Ukraina
JOSEPH         Iron Core     Korea

let's adding a new row

In [43]:
monkey = pd.Series(['Daemones', 'Philipines'], name = 'Monkey', index = TF.columns)
monkey

clan         Daemones
country    Philipines
Name: Monkey, dtype: object

In [44]:
TF.append(monkey)

                    clan     country
VN Pikachu  VN Champions    Viet Nam
ARMAGEDON        Dirilis     Ukraina
JOSEPH         Iron Core       Korea
Monkey          Daemones  Philipines

let's adding multiple rows

In [45]:
new_players = pd.DataFrame({
    'clan': ['VN Champions', 'King Allool', 'King Allool'],
    'country': ['Viet Nam', 'Indonesia', 'Banglades']
}, index = ['Meomeo888', 'Panglima Dayak', 'xXx-Hadi-xXx'], columns = TF.columns)
new_players

                        clan    country
Meomeo888       VN Champions   Viet Nam
Panglima Dayak   King Allool  Indonesia
xXx-Hadi-xXx     King Allool  Banglades

In [46]:
TF.append(new_players)

                        clan    country
VN Pikachu      VN Champions   Viet Nam
ARMAGEDON            Dirilis    Ukraina
JOSEPH             Iron Core      Korea
Meomeo888       VN Champions   Viet Nam
Panglima Dayak   King Allool  Indonesia
xXx-Hadi-xXx     King Allool  Banglades

In [47]:
#let ignore index when adding new rows
TF.append(new_players, ignore_index = True)

           clan    country
0  VN Champions   Viet Nam
1       Dirilis    Ukraina
2     Iron Core      Korea
3  VN Champions   Viet Nam
4   King Allool  Indonesia
5   King Allool  Banglades

In [48]:
#let's verify if we have duplicate index
pikachu_fake = pd.Series(['TF CUSTOMIZERS', '15'], name = 'VN Pikachu', index = TF.columns)
pikachu_fake

clan       TF CUSTOMIZERS
country                15
Name: VN Pikachu, dtype: object

In [49]:
try:
    TF.append(pikachu_fake, verify_integrity=True)
except:
    print('Duplicated index')

Duplicated index

## Deleting rows

<b><code>DataFrame.drop</b>

In [50]:
TF

                    clan   country
VN Pikachu  VN Champions  Viet Nam
ARMAGEDON        Dirilis   Ukraina
JOSEPH         Iron Core     Korea

In [51]:
#Delete multiple rows
TF.drop(index = ['VN Pikachu', 'JOSEPH'])

              clan  country
ARMAGEDON  Dirilis  Ukraina

In [52]:
#Delete 1 row inplace
TF.drop(index = 'ARMAGEDON', inplace = True)
TF

                    clan   country
VN Pikachu  VN Champions  Viet Nam
JOSEPH         Iron Core     Korea

# Tricks

Using `df.at` and `df.iat` to access or change a single cell in a dataframe, this is more efficient than `df.loc` and `df.iloc`

In [7]:
df = pd.DataFrame([['VN Pikachu', 31], ['Tank Cao', 35]])
df

            0   1
0  VN Pikachu  31
1    Tank Cao  35

In [4]:
%timeit df.iat[0, 0]

14.8 Âµs Â± 312 ns per loop (mean Â± std. dev. of 7 runs, 100000 loops each)

In [5]:
%timeit df.iloc[0, 0]

16.4 Âµs Â± 370 ns per loop (mean Â± std. dev. of 7 runs, 10000 loops each)

If you want to select only rows, or only columns, use `df.take` is more efficient

In [8]:
#select the first and second column
%timeit df.take([0, 1], axis='columns')

188 Âµs Â± 13.6 Âµs per loop (mean Â± std. dev. of 7 runs, 1000 loops each)

In [9]:
%timeit df.iloc[:, [0, 1]]

291 Âµs Â± 29.5 Âµs per loop (mean Â± std. dev. of 7 runs, 1000 loops each)

In [11]:
# select the second row
%timeit df.take([1], axis='index')

107 Âµs Â± 2.75 Âµs per loop (mean Â± std. dev. of 7 runs, 10000 loops each)

In [12]:
%timeit df.iloc[1, :]

101 Âµs Â± 1.86 Âµs per loop (mean Â± std. dev. of 7 runs, 10000 loops each)

To insert a column at a specific location, use **`df.insert`**

In [15]:
help(df.insert)

Help on method insert in module pandas.core.frame:

insert(loc, column, value, allow_duplicates=False) -> None method of pandas.core.frame.DataFrame instance
    Insert column into DataFrame at specified location.

    Raises a ValueError if `column` is already contained in the DataFrame,
    unless `allow_duplicates` is set to True.

    Parameters
    ----------
    loc : int
        Insertion index. Must verify 0 <= loc <= len(columns).
    column : str, number, or hashable object
        Label of the inserted column.
    value : int, Series, or array-like
    allow_duplicates : bool, optional

In [18]:
df.insert(loc=1, column='info',value=['M', 'M'])
df

            0 info gender   1
0  VN Pikachu    M      M  31
1    Tank Cao    M      M  35

Use **`df.query`** to filter

In [21]:
df.query('gender == "M"')

            0 info gender   1
0  VN Pikachu    M      M  31
1    Tank Cao    M      M  35

To select rows based on Index name or select columns based on Column name, use **`DataFrame.filter()`**

In [2]:
help(pd.DataFrame.filter)

Help on function filter in module pandas.core.generic:

filter(self: 'FrameOrSeries', items=None, like: 'Optional[str]' = None, regex: 'Optional[str]' = None, axis=None) -> 'FrameOrSeries'
    Subset the dataframe rows or columns according to the specified index labels.

    Note that this routine does not filter a dataframe on its
    contents. The filter is applied to the labels of the index.

    Parameters
    ----------
    items : list-like
        Keep labels from axis which are in items.
    like : str
        Keep labels from axis for which "like in label == True".
    regex : str (regular expression)
        Keep labels from axis for which re.search(regex, label) == True.
    axis : {0 or â€˜indexâ€™, 1 or â€˜columnsâ€™, None}, default None
        The axis to filter on, expressed either as an index (int)
        or axis name (str). By default this is the info axis,
        'index' for Series, 'columns' for DataFrame.

    Returns
    -------
    same type as input object

    See Also
    --------
    DataFrame.loc : Access a group of rows and columns
        by label(s) or a boolean array.

    Notes
    -----
    The ``items``, ``like``, and ``regex`` parameters are
    enforced to be mutually exclusive.

    ``axis`` defaults to the info axis that is used when indexing
    with ``[]``.

    Examples
    --------
    >>> df = pd.DataFrame(np.array(([1, 2, 3], [4, 5, 6])),
    ...                   index=['mouse', 'rabbit'],
    ...                   columns=['one', 'two', 'three'])
    >>> df
            one  two  three
    mouse     1    2      3
    rabbit    4    5      6

    >>> # select columns by name
    >>> df.filter(items=['one', 'three'])
             one  three
    mouse     1      3
    rabbit    4      6

    >>> # select columns by regular expression
    >>> df.filter(regex='e$', axis=1)
             one  three
    mouse     1      3
    rabbit    4      6

    >>> # select rows containing 'bbi'
    >>> df.filter(like='bbi', axis=0)
             one  two  three
    rabbit    4    5      6

**`DataFrame.assign`** is equivalent to **`dplyr::mutate`** in R

In [2]:
data = [
    ['VN Champions', 30],
    ['Dirilis', 35],
    ['Iron Core', 30]
]

TF = pd.DataFrame(data, index = ['VN Pikachu', 'ARMAGEDON', 'JOSEPH'], columns = ['clan', 'level'])
TF

                    clan  level
VN Pikachu  VN Champions     30
ARMAGEDON        Dirilis     35
JOSEPH         Iron Core     30

In [9]:
# Where the value is a callable, evaluated on `df`:
TF.assign(first_column = TF.level // 10, second_column = lambda df: df.first_column * 2)

                    clan  level  first_column  second_column
VN Pikachu  VN Champions     30             3              6
ARMAGEDON        Dirilis     35             3              6
JOSEPH         Iron Core     30             3              6

**select rows or colums on different range**
```python
df.iloc[:, np.r_[:10, 24:30]]
```